tutorials/chtMultiRegion4PCMFoam/porousPCM/system/cellSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name porousBox;

action new;

topoSetSources
(
    // Cells with cell centre within box
    boxToCell
    {
       box   (0.02 0.04 -0.005) (0.05 0.08 0.005);
    }

    zoneToCell
    {
        name "porousBox";//"chamber";      // Name of cellZone, regular expressions allowed
    }

    /*regionToCell
    {
        set         porousBox;         // name of cellSet giving mesh subset
        insidePoint (0.03 0.06 0);    // point inside region to select
    }*/
);


// ************************************************************************* //
